<template>
    <div class="container content">
        <div class="agreement-wrapper">
            <h1 class="agreement-title">幻安数字纪念品平台服务协议</h1>
            <h3 class="agreement-title">【首部及导言】</h3>
            <p class="agreement-row">1. 本协议为您与雄安区块链实验室（作为开发者）和雄安新区未来工业设计研究院（作为运营方）（以下统称“幻安”或“我们”）之间就获取（包括但不限于购买、兑换、领取或其他幻安支持的方式）数字纪念品（也称数字藏品）服务等相关事宜（以下合称“本服务”）所订立的具有法律约束力的契约。
            <p class="agreement-row">2. 本协议是幻安发布的相关协议规范、规则、声明、公告、政策等（以下合称“幻安服务条款”）制定，与其不可分割。本协议内容包括协议正文及所有我们已经发布的或将来可能发布或更新的各类规则，与协议正文不可分割并具有同等法律效力。<span class="stress">您在使用本服务时应遵守本协议、幻安服务条款及前述相关协议、服务规则等所有条款。</span>本协议未约定事宜，以幻安服务条款相关内容为准。</p>
            <p class="agreement-row">3. 使用本服务的用户必须具有使用幻安网站服务及获取数字藏品等行为的相应的民事权利能力和民事行为能力，能够独立承担法律责任。<span class="stress">我们在此特别提醒，您必须为年满14周岁的中国大陆居民，并通过幻安账号实名认证后方能获取数字藏品。如果您还未通过幻安账号实名认证，请在使用本服务前完成认证。如您不具有使用本服务数字藏品所需的民事权利能力和民事行为能力，我们有权采取本协议第四条第4款之操作措施。</span></p>
            <p class="agreement-row warning-text">4. 请您在接受本服务前阅读并充分理解本协议，特别是免除或者限制责任的相应条款。双方共同确认，前述条款不属于《民法典》第497条规定的“免除或者减轻其责任、加重对方责任、限制或排除对方主要权利”条款，您认可相应条款的合法性及有效性。</p>
            <p class="agreement-row">5. <span class="stress">我们有权根据需要不时地更新、修改本协议和/或各类规则，并将于相关页面进行公告，并不向您做特别通知。您使用本服务即视为您接受并同意本协议所有条款，包括但不限于前述更新及修改。如您违反本协议约定，我们有权随时中止或终止本服务，采取本协议第四条第4款之操作措施，并不予任何赔偿或退还费用。如您不同意本协议及其他各类规则的变更，您有权立即停止使用本服务。您继续使用本服务即表示您已接受经变更后的协议及其他各类规则。除我们另行明确声明，任何使本服务范围扩大或功能增强的新内容均受本协议约束。</span></p>
<h4 class="agreement-title">第一条 总则</h4>
<p class="agreement-row">1. 我们将根据实际情况，在幻安现有或未来可能开发有关数字藏品的网页、APP、小程序等平台，向您提供数字藏品浏览、获取、分享、订单管理、交易纠纷处理等服务，具体以数字藏品页面向您展示并说明的实际情况为准。</p>
<p class="agreement-row">2. 数字藏品是我们使用区块链技术标识的数字商品，具有区块链上的唯一性、加密性和不可篡改性。数字藏品由我们经品牌方、创作者等授权后联合代理发行并提供，或由第三方发行方通过我们向您提供，您可以在数字藏品页面，通过购买、兑换、领取或其他幻安支持的方式获取数字藏品，并按照数字藏品页面说明的具体方式进行使用。请您密切留意数字藏品页面展示的具体IP方和品牌方，以及其他数字藏品信息。您理解并同意，如该数字藏品由第三方发行，则该第三方发行方向您独立承担发行、购买等相关责任。</p>
<p class="agreement-row">3. 您理解并同意，数字藏品页面的图文展示介绍等相关信息均由我们或第三方发行方提供，除数字藏品页面另行说明外，数字藏品及其内容在全球范围内的包括知识产权在内的所有权利和权益，由我们、第三方发行方或原创作者（以下合称“权利人”）所有，您不得擅自将数字藏品用于任何商业用途。</p>
<p class="agreement-row">4. 除数字藏品页面另行说明外，同一份数字藏品只能获取1次。您同意并承诺，不会以以下方式试图获取、复制或不当使用数字藏品：</p>
<p class="agreement-row text-desc">(a) 通过非幻安官方指定的途径；</p>
<p class="agreement-row text-desc">(b) 通过盗用、租赁其他用户账户的方式；</p>
<p class="agreement-row text-desc">(c) 未经权利人授权，通过任何程序、软件、技术手段对数字藏品进行铸造、获取或复制，或对数字藏品的外观、使用期限、交易状态等信息进行修改；</p>
<p class="agreement-row text-desc">(d) 通过其他违反本协议、幻安服务条款、法律法规或社会公序良俗的方式；</p>
<p class="agreement-row text-desc">(e) 通过侵害幻安或他人合法权益的方式；</p>
<p class="agreement-row text-desc">(f) 通过其他不正当手段或违反诚实信用原则的方式。</p>
<p class="agreement-row">5. 除数字藏品页面另行说明，您获取的数字藏品应仅用于您研究、使用、观赏之目的，不得用于任何其他目的。<span class="stress">我们严禁您利用数字藏品进行炒作、场外交易、欺诈或以任何其他非法方式进行使用。我们保留随时根据业务发展和法律法规政策变化进行调整的权利。</span></p>
<p class="agreement-row">6. 在本服务功能允许的情况下，您可将所持数字藏品转赠给其他经实名认证的幻安用户。转赠的条件和限制将由我们或我们的关联方在有关页面载明。您理解并同意，转赠操作将无法撤销，且转赠成功后，与数字藏品相关的权利将全部转移至受赠人。</p>
<p class="agreement-row">7. 您同意并确认，在使用本服务过程中，我们将为您向我们的关联方、第三方发行方及其他合作方传递您的信息和指令，同时也可能从前述各方接收各项信息和指令并向您传递。在法律法规允许的情况下，我们也可能接受前述各方的委托，代替其发送或接受相关指令。<span class="stress">您理解并确认，鉴于数字藏品的特殊性，除本协议另有约定，所有指令和内容在发出后均无法撤销及变更。</span></p>
<p class="agreement-row">8.<span class="stress"> 您不得擅自以任何商业目的使用您通过本服务接触或了解到的各类信息，也不得擅自使用任何第三方软件、插件、外挂、系统等查看、获取本服务中所包含的我们、我们的关联方、第三方发行方及其他合作方以及其他用户的任何相关信息。</span></p>
<h4 class="agreement-title">第二条 用户信息</h4>
<p class="agreement-row">1. <span class="stress">为及时向您提供本服务，您承诺并保证向我们所提供的用户信息真实、准确、完整、合法有效并及时更新，否则您需自行承担因此产生的相应责任及后果。如您提供虚假用户信息，我们有权采取本协议第四条第4款之操作措施，并不予任何赔偿或退还任何费用。</span></p>
<p class="agreement-row">2. 本服务使用的是您在我们和/或我们的关联方系统注册的账号及密码。您需妥善保管好您的账号及密码，加强密码安全性，谨防泄露或被盗，并对您账号项下发生的所有行为负责。<span class="stress">当您的账号或密码遭到未经授权的使用时，您应当立即通知我们，否则未经授权的使用行为将被视为您本人的行为。</span>当您的账号遇到争议时，我们有权根据您的注册和绑定用户信息，在技术可达的水平下，对您的身份进行识别。但是，我们对鉴定用户身份的准确性和真实性不做任何承诺和保证。</p>
<p class="agreement-row">3. 您同意我们将通过邮件、短信、电话等形式与您进行联系、发送订单信息及促销活动信息等。您继续使用本服务则表明您已授权同意接收该等信息。</p>
<h4 class="agreement-title">第三条 服务细则</h4>
<h5 class="agreement-row">1. 数字藏品获取规则</h5>
<p class="agreement-row text-desc">(a) 我们将通过数字藏品页面向您展示数字藏品的基本信息，包括待获取的数字藏品名称、介绍、价格、发行数量、使用期限及其他商品介绍及使用规则。<span class="stress">请您在获取前仔细阅读数字藏品页面中的全部信息，如有疑问请与客服人员联系确认后获取。您同意并确认，您在数字藏品页面下单、点击领取或进行其他同意获取数字藏品的操作，即代表您已全面了解并认同数字藏品页面中的信息。</span></p>
<p class="agreement-row text-desc">(b) 为了向您提供数字藏品，您授权我们获取您的幻安账号uid、昵称、实名认证结果、年龄、手机号码以及其它必要的交易信息和联系信息。</p>
<p class="agreement-row text-desc">(c) <span class="stress">您同意并确认，为确保资金及交易安全，您将只接受我们实际提供的方式获取数字藏品（包括但不限于支付方式等）。您同时授权我们有权按照我们的关联方和/或第三方发行方及其他合作方发出的指令，为您提供资金结算和账户管理等服务。如您发现任何未经授权使用您幻安账号或其他可能导致您账户遭窃、遗失的情况，建议您立即联系我们。您理解我们、我们的关联方和/或第三方发行方及其他合作方对您的任何请求采取行动均需要合理时间，且应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大。除法律明确规定我们存在重大过失，我们不承担任何法律责任。</span></p>
<p class="agreement-row text-desc">(d) <span class="stress">您同意并确认，为了保障交易安全、有序、合法的进行，以及履行我们反洗钱的义务，我们有权对您的区块链空间交易地址进行安全核查。如发现存在炒作、欺诈等异常行为，或您存在违反法律法规或本协议约定等情形，我们有权采取本协议第四条第4款之操作措施，并不予任何赔偿或退还任何费用。</span></p>
<p class="agreement-row text-desc">(e) 您不得以任何非法目的或以任何非法形式使用本服务，您进一步承诺并保证，您对您所实施的任何行为以及所发布的任何信息拥有完整、合法、有效的权利，并且符合相关法律法规及本协议的要求，不存在任何违反法律法规、国家政策以及其他违背社会公共利益、公共道德或侵犯他人合法权益的信息或行为。</p>
<h5 class="agreement-row">2. 数字藏品购买规则</h5>
<p class="agreement-row text-desc">(a) 如您通过购买方式获取数字藏品，我们建议您在下单后、完成付款前，再次确认所订购的数字藏品信息是否符合预期，如不符合预期，请立即放弃付款。<span class="stress">您同意并确认，您成功下单并完成付款之时，即为您与我们或第三方发行方之间就具体数字藏品交易合同关系成立之时，交易各方发出的指令和内容无法撤销或更改。除本协议或法律法规另行规定外，您不得要求撤销合同、要求退款或更换商品。</span></p>
<p class="agreement-row text-desc">(b) 若您在成功提交订单后的规定时间内未能完成付款，系统将自动取消该订单，您与我们均无需向对方承担任何责任。</p>
<p class="agreement-row text-desc">(c) <span class="stress">您同意并确认，数字藏品系网络虚拟商品，采用先收费后使用的方式。除本协议或数字藏品页面另行规定外，您购买数字藏品支付的费用是网络商品价格，而非预付款性质或者定金、储值等性质。</span></p>
<p class="agreement-row text-desc">(d) 数字藏品价格以购买时的数字藏品页面展示的价格为准。如您使用优惠券（或折扣券）、参加优惠活动和/或在优惠时段购买数字藏品等，数字藏品的实际价格以结算页面价格为准。优惠券（或折扣券）、优惠活动和/或在优惠时段的具体内容和/或规则请以优惠页面信息为准。</p>
<p class="agreement-row text-desc">(e) 您承诺并保证，您的购买行为应当基于真实的消费需要，不存在投资或投机的行为，不得存在恶意购买、恶意维权等扰乱正常交易秩序的行为。</p>
<h5 class="agreement-row">3. 数字藏品售后规则</h5>
<p class="agreement-row"><span class="stress">鉴于数字藏品的特殊性，除本协议、数字藏品页面或法律法规另行规定，数字藏品一经获取不可退换。如您不接受前述条款，您应停止使用本服务。</span></p>
<h4 class="agreement-title">第四条 服务变更、中断和终止</h4>
<p class="agreement-row">1. 虽然我们将尽合理商业努力为您提供积极有效的服务支持，但由于技术水平局限和网络服务的特殊性，我们无法保证本服务一定能满足您的要求，包括但不限于服务的及时性、安全性和准确性。<span class="stress">您同意并确认，您在确认接受本协议或使用本服务前已充分了解我们提供的商品和服务，并同意我们无须就已存在的瑕疵、功能不足或任何需改进事项对您承担除法律法规明确规定外的责任。我们保留根据实际情况随时调整提供的服务种类及形式的权利，我们不承担因业务调整给您造成的损失。</span></p>
<p class="agreement-row">2. 您理解本服务的提供依赖于我们系统的准确运行及操作。若出现前述系统差错、故障或其他原因引发了展示错误、您或我们或他人不当获利等情形的，我们可以采取更正差错、暂停服务、冻结款项等适当纠正措施</p>
<p class="agreement-row">3. <span class="stress">在下列情况下，我们可以在通知或不通知您的情况下，随时中止或终止向您提供本服务，并在有必要时单方解除本协议：</span></p>
<p class="agreement-row text-desc">(a) 您不具备使用本服务的相应的民事权利能力和民事行为能力，或您未通过幻安账号实名认证的；</p>
<p class="agreement-row text-desc">(b) 本协议及其他各类规则变更时，您不接受变更的；</p>
<p class="agreement-row text-desc">(c) 您以不正当方式试图获取、复制或使用数字藏品的；</p>
<p class="agreement-row text-desc">(d) 您利用数字藏品进行洗钱、赌博、炒作、场外交易、欺诈或以任何其他方式进行非法使用的；</p>
<p class="agreement-row text-desc">(e) 您存在恶意购买、恶意获取、恶意维权等扰乱正常交易秩序的行为的；</p>
<p class="agreement-row text-desc">(f) 您出于商业目的，擅自查看、获取或使用您通过本服务接触或了解到的信息的；</p>
<p class="agreement-row text-desc">(g) 您侵害或恶意攻击本服务系统的；</p>
<p class="agreement-row text-desc">(h) 您在获取数字藏品时提供的用户信息或联系信息是虚假的，或您使用无效账号进行操作的；</p>
<p class="agreement-row text-desc">(i) 我们通过您在获取数字藏品填写的联系信息联系您，但发现您的联系信息已不存在或无法使用，且经我们以其它联系方式（如有）通知，您在10个工作日内仍未能进行联系信息更新的；</p>
<p class="agreement-row text-desc">(j) 您违反本协议和/或各类规则、幻安服务条款其他相关规定的；</p>
<p class="agreement-row text-desc">(k) 您存在其他任何违反法律法规、国家政策以及其他违背社会公共利益、公共道德或侵犯他人合法权益的信息或行为；</p>
<p class="agreement-row text-desc">(l) 您因存在前述行为被我们暂停或终止服务，但您再一次直接或间接或以他人名义注册为幻安用户的。</p>
<p class="agreement-row">4. <span class="stress">在上述第3款的情况下，我们将采取的措施操作包括但不限于：</span></p>
<p class="agreement-row text-desc">(a) 主动执行关闭相关订单；</p>
<p class="agreement-row text-desc">(b) 限制您访问、使用数字藏品；</p>
<p class="agreement-row text-desc">(c) 对违法违规信息进行删除或屏蔽；</p>
<p class="agreement-row text-desc">(d) 暂停或终止向您提供部分或全部服务；</p>
<p class="agreement-row text-desc">(e) 对您的账号采取资金止付、划扣等措施；</p>
<p class="agreement-row text-desc">(f) 限制、冻结或封禁您的账号；</p>
<p class="agreement-row text-desc">(g) 从系统中永久地删除您的数据；</p>
<p class="agreement-row text-desc">(h) 如您的行为使我们及/或我们的关联方等遭受损失或他人主张权利，我们保留要求您赔偿损失的权利；</p>
<p class="agreement-row text-desc">(i) 在相关页面公告您的违规行为；</p>
<p class="agreement-row text-desc">(j) 向有关机构报告您的违规行为；</p>
<p class="agreement-row text-desc">(k) 采取适用法律和法规允许的任何其他行动。</p>
<h4 class="agreement-title">第五条 责任限制</h4>
<p class="agreement-row">1. 我们的责任范围仅限于尽合理商业努力，确保在幻安上架的数字藏品本身无明确违反法律法规的情形。您理解并确认，我们仅以“现状”和“可得到”的状态向您提供本服务。我们不对提供的数字藏品的适用性或满足您特定需求和目的进行任何明示或者默示的担保。<span class="stress">您进一步同意并确认，您在获取数字藏品前已确认自己的需求，同时仔细阅读数字藏品页面信息。如因您自身原因产生的数字藏品无法正常加载、使用等情况，由您自行承担责任。</span></p>
<p class="agreement-row">2. 您同意并确认，因权利人授权合约限制等原因，部分数字藏品在使用地区、使用方式、使用期限等方面存在限制，我们将在数字藏品页面进行相应说明。请您在获取数字藏品前仔细阅读数字藏品页面中的全部信息，如有疑问，请与我们的客服联系确认后获取。</p>
<p class="agreement-row">3. 您同意并确认，鉴于网络服务的特殊性，您在使用本服务的过程中可能会遇到不可抗力等风险因素影响。如出现下列情况之一，致使我们无法履行本协议项下约定或您无法完成数字藏品交易的，我们将努力在第一时间及时进行修复。<span class="stress">但是，由此给您或他人造成的损失，我们不承担责任：</span></p>
<p class="agreement-row text-desc">(a) 与本服务相关的系统、技术、服务体系停机维护或升级；</p>
<p class="agreement-row text-desc">(b) 因经营策略调整或配合国家重大技术、法规政策等变化需中止、中断或调整服务；</p>
<p class="agreement-row text-desc">(c) 因自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、法律法规政策变化和政府行为等不可抗力原因；</p>
<p class="agreement-row text-desc">(d) 因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、电信设备故障、第三方服务瑕疵等原因。</p>
<p class="agreement-row">4. 就第三方发行的数字藏品：</p>
<p class="agreement-row text-desc">(a) 由第三方发行方保证对该商品享有作为权利人完整、合法、有效的权利或已取得权利人的合法授权，保证有权开展数字藏品的铸造、发行、转赠等场景的应用活动，并保证其开展数字藏品业务不违反任何法律法规或侵犯他人的合法权益。如因数字藏品第三方发行方或原创作者侵权、发布危害国家利益、违反公序良俗以及其他可能产生严重负面舆情的言论或行为，或者数字藏品存在权利瑕疵、内容违法违规等情形，导致数字藏品被屏蔽或限制使用的，您同意我们无需承担相关责任，您应与第三方发行方自行联系并解决。</p>
<p class="agreement-row text-desc">(b) 如第三方发行方取消或延期发行，或您与第三方发行方之间产生其他争议或纠纷，您应与第三方发行方自行联系并解决，我们仅负责协调有关事宜。如您通过我们的客服与第三方发行方进行争议协调处理，您需要提供初步凭证证明您的主张。您理解并同意，我们的客服并非专业人士，除存在故意或重大过失，我们对做出的争议调处或其他处理决定不承担责任。</p>
<h4 class="agreement-title">第六条 知识产权声明</h4>
<p class="agreement-row">本服务涉及的所有内容，包括文字、图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计等，均由我们或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。<span class="stress">非经我们或其他权利人书面同意，您不得擅自使用、修改、反向编译、复制、公开传播、改变、散布、发行或公开发表、转让、许可、商业利用相关软件、内容以及其他知识产权，</span>否则我们有权立即终止本协议，并要求您对您的违约或侵权行为给我们或其他权利人造成的损失承担相应赔偿责任。</p>
<h4 class="agreement-title">第七条 法律管辖和适用</h4>
<p class="agreement-row">1. 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国大陆地区适用之有效法律。</p>
<p class="agreement-row">2. 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均应提交北京仲裁委员会按照该会仲裁规则进行仲裁。仲裁语言为中文。仲裁裁决是终局的，对双方均有约束力。</p>
        </div>
    </div>
</template>
<style rel="stylesheet/scss" lang="scss" scoped>
.agreement-wrapper{
    display: flex;
    flex-direction: column;
    padding: 50px 20px;
    font-family: MiSans Semibold;
    p{
        padding: 0;
        margin: 0;
        line-height: 30px;
    }
    h5{
        margin-top: 20px;
    }
    .agreement-title{
        width: 100%;
        text-align: center;
        margin-top: 20px;
    }
    .agreement-row{
        text-indent:28px;
        .stress{
            font-weight: 600;
        }
    }
    .warning-text{
        color: red;
        text-decoration: underline;
    }
    .text-desc{
        text-indent:50px;
    }
}
</style>